{
    "format": "graph-model",
    "generatedBy": "2.4.1",
    "convertedBy": "TensorFlow.js Converter v3.3.0",
    "signature": {
        "inputs": {
            "input_1:0": {
                "name": "input_1:0",
                "dtype": "DT_INT64",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "100"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "Identity:0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "100"
                        },
                        {
                            "size": "118"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/axes",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/GatherV2_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/Const_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1024"
                                    },
                                    {
                                        "size": "118"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayV2_1/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/Read/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "3072"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "ConstantFolding/StatefulPartitionedCall/my_model/gru/PartitionedCall/unstack-folded-0",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3072"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/strided_slice/stack",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/strided_slice/stack_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/zeros/packed/1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/zeros/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/Read_1/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1024"
                                    },
                                    {
                                        "size": "3072"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "ConstantFolding/StatefulPartitionedCall/my_model/gru/PartitionedCall/unstack-folded-1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3072"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/time",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/transpose/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice/stack",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice/stack_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/loop_counter",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/transpose_1/perm",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/free",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/GatherV2/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/Const_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/Tensordot/concat_1/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/dense/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "118"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "unknown",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "118"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/embedding/embedding_lookup/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "input_1",
                "op": "Placeholder",
                "attr": {
                    "dtype": {
                        "type": "DT_INT64"
                    },
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "100"
                                }
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_27",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/Read/ReadVariableOp"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_28",
                "op": "Enter",
                "input": [
                    "ConstantFolding/StatefulPartitionedCall/my_model/gru/PartitionedCall/unstack-folded-0"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_29",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/Read_1/ReadVariableOp"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_30",
                "op": "Enter",
                "input": [
                    "ConstantFolding/StatefulPartitionedCall/my_model/gru/PartitionedCall/unstack-folded-1"
                ],
                "attr": {
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_22",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/time"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_20",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/loop_counter"
                ],
                "attr": {
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    },
                    "T": {
                        "type": "DT_INT32"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/embedding/embedding_lookup",
                "op": "GatherV2",
                "input": [
                    "unknown",
                    "input_1",
                    "StatefulPartitionedCall/my_model/embedding/embedding_lookup/axis"
                ],
                "attr": {
                    "Taxis": {
                        "type": "DT_INT64"
                    },
                    "batch_dims": {
                        "i": "0"
                    },
                    "Tindices": {
                        "type": "DT_INT64"
                    },
                    "Tparams": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_38",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_27",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_74"
                ],
                "attr": {
                    "N": {
                        "i": "2"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_39",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_28",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_75"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_40",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_29",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_76"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_41",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_30",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_77"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_33",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_22",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_69"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_31",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_20",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_67"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/Shape",
                "op": "Shape",
                "input": [
                    "StatefulPartitionedCall/my_model/embedding/embedding_lookup"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "out_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/transpose",
                "op": "Transpose",
                "input": [
                    "StatefulPartitionedCall/my_model/embedding/embedding_lookup",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/transpose/perm"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "Tperm": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/strided_slice",
                "op": "StridedSlice",
                "input": [
                    "StatefulPartitionedCall/my_model/Shape",
                    "StatefulPartitionedCall/my_model/strided_slice/stack",
                    "StatefulPartitionedCall/my_model/strided_slice/stack_1",
                    "StatefulPartitionedCall/my_model/strided_slice/stack_2"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "shrink_axis_mask": {
                        "i": "1"
                    },
                    "ellipsis_mask": {
                        "i": "0"
                    },
                    "begin_mask": {
                        "i": "0"
                    },
                    "new_axis_mask": {
                        "i": "0"
                    },
                    "end_mask": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor",
                "op": "TensorListFromTensor",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/transpose",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "element_dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/Shape",
                "op": "Shape",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/transpose"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "out_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/zeros/packed",
                "op": "Pack",
                "input": [
                    "StatefulPartitionedCall/my_model/strided_slice",
                    "StatefulPartitionedCall/my_model/zeros/packed/1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "axis": {
                        "i": "0"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_26",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"
                ],
                "attr": {
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    },
                    "T": {
                        "type": "DT_VARIANT"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice",
                "op": "StridedSlice",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/Shape",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice/stack",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice/stack_1",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice/stack_2"
                ],
                "attr": {
                    "new_axis_mask": {
                        "i": "0"
                    },
                    "end_mask": {
                        "i": "0"
                    },
                    "T": {
                        "type": "DT_INT32"
                    },
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "shrink_axis_mask": {
                        "i": "1"
                    },
                    "begin_mask": {
                        "i": "0"
                    },
                    "ellipsis_mask": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/zeros",
                "op": "Fill",
                "input": [
                    "StatefulPartitionedCall/my_model/zeros/packed",
                    "StatefulPartitionedCall/my_model/zeros/Const"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "index_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_37",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_26",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_73"
                ],
                "attr": {
                    "T": {
                        "type": "DT_VARIANT"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayV2_1",
                "op": "TensorListReserve",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayV2_1/element_shape",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "element_dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_25",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/strided_slice"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_24",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/zeros"
                ],
                "attr": {
                    "is_constant": {
                        "b": false
                    },
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_23",
                "op": "Enter",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayV2_1"
                ],
                "attr": {
                    "parallel_iterations": {
                        "i": "32"
                    },
                    "frame_name": {
                        "s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbXlfbW9kZWwvZ3J1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="
                    },
                    "T": {
                        "type": "DT_VARIANT"
                    },
                    "is_constant": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_36",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_25",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_72"
                ],
                "attr": {
                    "N": {
                        "i": "2"
                    },
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_35",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_24",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_71"
                ],
                "attr": {
                    "N": {
                        "i": "2"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_34",
                "op": "Merge",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/enter/_23",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/next_iteration/_70"
                ],
                "attr": {
                    "T": {
                        "type": "DT_VARIANT"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/cond/_18/while/Less",
                "op": "Less",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_33",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_36",
                    "^StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_31"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42",
                "op": "LoopCond",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/cond/_18/while/Less"
                ]
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/StatefulPartitionedCall/my_model/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_49",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_37",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_VARIANT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/my_model/gru/PartitionedCall/input/_11_switch/_50",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_38",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/StatefulPartitionedCall/my_model/gru/PartitionedCall/unstack_switch/_51",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_39",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/my_model/gru/PartitionedCall/input/_10_switch/_47",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_35",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/Func/StatefulPartitionedCall/my_model/gru/PartitionedCall/input/_12_switch/_52",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_40",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/StatefulPartitionedCall/my_model/gru/PartitionedCall/unstack_switch/_53",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_41",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/StatefulPartitionedCall/my_model/gru/PartitionedCall/time_switch/_45",
                "op": "Switch",
                "input": [
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/merge/_33",
                    "StatefulPartitionedCall/my_model/gru/PartitionedCall/while/LoopCond/_42"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
